DRIVERS_NAMES = {
    "RELY": "Требуемая надежность",
    "DATA": "Размер базы данных",
    "CPLX": "Сложность продукта",
    "TIME": "Ограничение времени выполнения",
    "STOR": "Ограничение объема основной памяти",
    "VIRT": "Изменчивость виртуальной машины",
    "TURN": "Время реакции компьютера",
    "ACAP": "Способности аналитика",
    "AEXP": "Знание приложений",
    "PCAP": "Способности программиста",
    "VEXP": "Знание виртуальной машины",
    "LEXP": "Знание языка программирования",
    "MODP": "Использование современных методов",
    "TOOL": "Использование программных инструментов",
    "SCED": "Требуемые сроки разработки",
    "KLOC": "Количество строк кода",
}


DRIVERS_DEFAULT_VALUES = {
    'RELY': [0.75, 0.86, 1.0, 1.15, 1.40],
    'DATA': [0.94, 1.0, 1.08, 1.16],
    'CPLX': [0.70, 0.85, 1.0, 1.15, 1.30],
    'TIME': [1.0, 1.11, 1.50],
    'STOR': [1.0, 1.06, 1.21],
    'VIRT': [0.87, 1.0, 1.15, 1.30],
    'TURN': [0.87, 1.0, 1.07, 1.15],
    'ACAP': [1.46, 1.19, 1.0, 0.86, 0.71],
    'AEXP': [1.29, 1.15, 1.0, 0.91, 0.82],
    'PCAP': [1.42, 1.17, 1.0, 0.86, 0.70],
    'VEXP': [1.21, 1.10, 1.0, 0.90],
    'LEXP': [1.14, 1.07, 1.0, 0.95],
    'MODP': [1.24, 1.10, 1.0, 0.91, 0.82],
    'TOOL': [1.24, 1.10, 1.0, 0.91, 0.82],
    'SCED': [1.23, 1.08, 1.0, 1.04, 1.10],
}


DRIVERS_VALUES = {
    'RELY': 1,
    'DATA': 1,
    'CPLX': 1,
    'TIME': 1,
    'STOR': 1,
    'VIRT': 1,
    'TURN': 1,
    'ACAP': 1,
    'AEXP': 1,
    'PCAP': 1,
    'VEXP': 1,
    'LEXP': 1,
    'MODP': 1,
    'TOOL': 1,
    'SCED': 1,
}


PROJECT_MODES_NAMES = {
    0: "organic",
    1: "semidetached",
    2: "embedded",
}


PROJECT_MODES = {
    "organic":      {"c1": 3.2, "p1": 1.05, "c2": 2.5, "p2": 0.38},
    "semidetached": {"c1": 3.0, "p1": 1.12, "c2": 2.5, "p2": 0.35},
    "embedded":     {"c1": 2.8, "p1": 1.20, "c2": 2.5, "p2": 0.32},
}


# Таблица проекта
WORK_PERCENT = 0
WORK = 1
TIME_PERCENT = 2
TIME = 3
EMPLOYEES = 4

# Таблица бюджета
BUDGET_PERCENT = 0
WORK_BUDGET = 1
MONEY = 2

# Режимы в define
LOW_LOW = 0
LOW = 1
NORMAL = 2
HIGH = 3
HIGH_HIGH = 4


# Режимы для печати
LEVEL_NAME = {
    0: "Очень низкий",
    1: "Низкий",
    2: "Номинальный",
    3: "Высокий",
    4: "Очень высокий",
}
